Autodesk.Revit.DB.Events.RevitEventArgs.Cancellable
Indicates whether an event may be cancelled by an event delegate.
Remarks:
If 'Cancellable' is true, event delegates may cancel the command that
was announced by the event. To do so, a delegate would set the 'Cancel' property to True.
Typically, post-events (e.g. DocumentPrinted) are not cancellable,
while most pre-events (e.g. DocumentPrinting) are cancellable, except for special
conditions and situations, such as when the Revit application is being closed
or if an event is raised during another event.

Autodesk.Revit.DB.Events.RevitEventArgs.Cancel
Indicates whether the event is being cancelled.
When the event is cancellable, set the property to True to cancel it.
Remarks:
If an event delegate wishes to cancel the event, it should set the value of this
property to True. Not every event is cancellable.
Whether or not an event may be cancelled is indicated by the value of 'Cancellable' property.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown if an event delegate attempts to cancel a non-cancellable event.

Autodesk.Revit.DB.Events.RevitEventArgs
The class is used as base class for all event argument classes.